app/controllers/issues_controller.rb

  def edit
    @issue = Issue.find(params[:id])
---
SELECT * FROM "issues" WHERE ("issues"."id" = 2)

  def create
    @issue = Issue.new(params[:issue])
    respond_to do |format|
      if @issue.save
---
INSERT INTO "issues" ("month", "active", "closed", "created_at", "updated_at") VALUES('2010-01-01', 5, 7.0, '2010-10-27 20:30:25.760460', '2010-10-27 20:30:25.760460') RETURNING "id"

  def update
    @issue = Issue.find(params[:id])
    if @issue.update_attributes(params[:issue])
---
SELECT * FROM "issues" WHERE ("issues"."id" = 2)
UPDATE "issues" SET "month" = '2010-03-02', "updated_at" = '2010-10-27 20:34:04.862992' WHERE "id" = 2