app/controllers/milestones_controller.rb

  def edit
    @milestone = Milestone.find(params[:id])
---
SELECT * FROM "milestones" WHERE ("milestones"."id" = 1)

  def create
    @milestone = Milestone.new(params[:milestone])
    respond_to do |format|
      if @milestone.save
---
INSERT INTO "milestones" ("month", "build", "unbuild", "created_at", "updated_at") VALUES('2010-01-01', 3, 3, '2010-10-27 20:42:17.258155', '2010-10-27 20:42:17.258155') RETURNING "id"

  def update
    @milestone = Milestone.find(params[:id])
    if @milestone.update_attributes(params[:milestone])
---
SELECT * FROM "milestones" WHERE ("milestones"."id" = 1)
UPDATE "milestones" SET "unbuild" = 5, "updated_at" = '2010-10-27 20:42:34.349133' WHERE "id" = 1