app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "location", "created_at", "updated_at") VALUES('Project2', 'chennai', '2010-10-27 21:30:48.676679', '2010-10-27 21:30:48.676679') RETURNING "id"