app/controllers/project_performances_controller.rb

SELECT * FROM "project_performances" WHERE ("project_performances"."id" = 1)
---
  def edit
    @project_performance = ProjectPerformance.find(params[:id])

INSERT INTO "project_performances" ("month", "pv", "lrecontract", "lrepmc", "contractindex", "cpi", "spi", "created_at", "updated_at") VALUES('2010-01-01', 4, 6, 7, 7.0, 7.0, 3.0, '2010-10-27 20:40:15.174173', '2010-10-27 20:40:15.174173') RETURNING "id"
---
  def create
    @project_performance = ProjectPerformance.new(params[:project_performance])
    respond_to do |format|
      if @project_performance.save

SELECT * FROM "project_performances" WHERE ("project_performances"."id" = 1)
UPDATE "project_performances" SET "contractindex" = 4.0, "updated_at" = '2010-10-27 20:40:48.331069' WHERE "id" = 1
---
  def update
    @project_performance = ProjectPerformance.find(params[:id])
     if @project_performance.update_attributes(params[:project_performance])