app/controllers/risks_controller.rb

  def edit
    @risk = Risk.find(params[:id])
---
SELECT * FROM "risks" WHERE ("risks"."id" = 1)

  def create
    @risk = Risk.new(params[:risk])
    respond_to do |format|
      if @risk.save
---
INSERT INTO "risks" ("month", "active", "closed", "created_at", "updated_at") VALUES('2010-02-01', 4, 7, '2010-10-27 21:05:44.999674', '2010-10-27 21:05:44.999674') RETURNING "id"

  def update
    @risk = Risk.find(params[:id])
      if @risk.update_attributes(params[:risk])
---
SELECT * FROM "risks" WHERE ("risks"."id" = 3)
UPDATE "risks" SET "month" = '2003-02-09', "updated_at" = '2010-10-27 21:07:05.893300' WHERE "id" = 3